Revit 2027 API
DirectShape.HasExternallyTaggedReference Method
 Checks if the externally tagged reference is already present in this DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasExternallyTaggedReference(
	ExternalGeometryId externalId
)
Public Function HasExternallyTaggedReference (
	externalId As ExternalGeometryId
) As Boolean
public:
bool HasExternallyTaggedReference(
	ExternalGeometryId^ externalId
)
member HasExternallyTaggedReference :
        externalId : ExternalGeometryId -> bool
Parameters
externalId ExternalGeometryId
 The external ID of the tagged reference to check for.
Return Value
Boolean
 True if the DirectShape holds a reference with the specified ExternalGeometryId.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace